[info]
drivername=DTSPipeline150
symbolfile=dtsperf.h

[languages]
009=English
419=Russian (Russia)

[objects]
PRFOBJ_PIPELINE_START_009_NAME=SQLServer:SSIS Pipeline 15.0

PRFOBJ_PIPELINE_START_419_NAME=SQLServer:SSIS Pipeline 15.0

[text]
PRFOBJ_PIPELINE_START_009_NAME=SQLServer:SSIS Pipeline 15.0
PRFOBJ_PIPELINE_START_009_HELP=The SSIS Pipeline object includes those counters related to the execution of the pipeline.

PIPELINE_CTR_ROWSREAD_009_NAME=Rows read
PIPELINE_CTR_ROWSREAD_009_HELP=The number of rows read from all data sources in total.

PIPELINE_CTR_ROWSWRITTEN_009_NAME=Rows written
PIPELINE_CTR_ROWSWRITTEN_009_HELP=The number of rows written to all data destinations in total.

PIPELINE_CTR_BUFFERSINUSE_009_NAME=Buffers in use
PIPELINE_CTR_BUFFERSINUSE_009_HELP=The number of pipeline buffers in use throughout the pipeline.

PIPELINE_CTR_BUFFERMEMORY_009_NAME=Buffer memory
PIPELINE_CTR_BUFFERMEMORY_009_HELP=The amount of memory allocated to buffers in the pipeline.

PIPELINE_CTR_PRIVATEBUFFERSINUSE_009_NAME=Private buffers in use
PIPELINE_CTR_PRIVATEBUFFERSINUSE_009_HELP=The number of private transformation buffers in use throughout the pipeline.

PIPELINE_CTR_PRIVATEBUFFERMEMORY_009_NAME=Private buffer memory
PIPELINE_CTR_PRIVATEBUFFERMEMORY_009_HELP=The amount of memory allocated to private transformation buffers.

PIPELINE_CTR_FLATBUFFERSINUSE_009_NAME=Flat buffers in use
PIPELINE_CTR_FLATBUFFERSINUSE_009_HELP=The number of flat memory buffers in use throughout the pipeline.

PIPELINE_CTR_FLATBUFFERMEMORY_009_NAME=Flat buffer memory
PIPELINE_CTR_FLATBUFFERMEMORY_009_HELP=The amount of memory allocated to flat memory buffers.

PIPELINE_CTR_SWAPPEDBUFFERS_009_NAME=Buffers spooled
PIPELINE_CTR_SWAPPEDBUFFERS_009_HELP=The number of buffers spooled to disk.

PIPELINE_CTR_BLOBBYTESREAD_009_NAME=BLOB bytes read
PIPELINE_CTR_BLOBBYTESREAD_009_HELP=The number of BLOB bytes read from all data sources in total.

PIPELINE_CTR_BLOBBYTESWRITTEN_009_NAME=BLOB bytes written
PIPELINE_CTR_BLOBBYTESWRITTEN_009_HELP=The number of BLOB bytes written to all data sources in total.

PIPELINE_CTR_BLOBFILESINUSE_009_NAME=BLOB files in use
PIPELINE_CTR_BLOBFILESINUSE_009_HELP=The number of BLOB spooling files in use throughout the pipeline.


PRFOBJ_PIPELINE_START_419_NAME=SQLServer:SSIS Pipeline 15.0
PRFOBJ_PIPELINE_START_419_HELP=Объект конвейера служб SSIS содержит счетчики, относящиеся к работе конвейера.

PIPELINE_CTR_ROWSREAD_419_NAME=Считано строк
PIPELINE_CTR_ROWSREAD_419_HELP=Общее количество строк, считанных из всех источников данных.

PIPELINE_CTR_ROWSWRITTEN_419_NAME=Записано строк
PIPELINE_CTR_ROWSWRITTEN_419_HELP=Общее количество строк, записанных во все назначения данных.

PIPELINE_CTR_BUFFERSINUSE_419_NAME=Используется буферов
PIPELINE_CTR_BUFFERSINUSE_419_HELP=Число используемых буферов по всему конвейеру.

PIPELINE_CTR_BUFFERMEMORY_419_NAME=Память буферов
PIPELINE_CTR_BUFFERMEMORY_419_HELP=Объем памяти, выделенной в конвейере для буферов.

PIPELINE_CTR_PRIVATEBUFFERSINUSE_419_NAME=Используется частных буферов
PIPELINE_CTR_PRIVATEBUFFERSINUSE_419_HELP=Число используемых частных буферов преобразования по всему конвейеру.

PIPELINE_CTR_PRIVATEBUFFERMEMORY_419_NAME=Память частных буферов
PIPELINE_CTR_PRIVATEBUFFERMEMORY_419_HELP=Объем памяти, выделенной для частных буферов преобразований.

PIPELINE_CTR_FLATBUFFERSINUSE_419_NAME=Используется плоских буферов
PIPELINE_CTR_FLATBUFFERSINUSE_419_HELP=Число используемых плоских буферов памяти по всему конвейеру.

PIPELINE_CTR_FLATBUFFERMEMORY_419_NAME=Память плоских буферов
PIPELINE_CTR_FLATBUFFERMEMORY_419_HELP=Объем памяти, выделенной для плоских буферов памяти.

PIPELINE_CTR_SWAPPEDBUFFERS_419_NAME=Выгружено буферов
PIPELINE_CTR_SWAPPEDBUFFERS_419_HELP=Число буферов, выгруженных на диск.

PIPELINE_CTR_BLOBBYTESREAD_419_NAME=Считано байт большого двоичного объекта
PIPELINE_CTR_BLOBBYTESREAD_419_HELP=Общее число байт большого двоичного объекта, считанных из всех источников данных.

PIPELINE_CTR_BLOBBYTESWRITTEN_419_NAME=Записано байт большого двоичного объекта
PIPELINE_CTR_BLOBBYTESWRITTEN_419_HELP=Общее число байт большого двоичного объекта, записанных во все источники данных.

PIPELINE_CTR_BLOBFILESINUSE_419_NAME=Используется файлов большого двоичного объекта
PIPELINE_CTR_BLOBFILESINUSE_419_HELP=Число файлов выгрузки большого двоичного объекта, используемых по всему конвейеру.

